papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/blobInTreacle/base/quasiMonolitic/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 12;

method scotch;

monolithicCoeffs
{
    regions (fluid solid);

    regionWeights
    {
        fluid 3; // nDofs in fluid cell
        solid 2; // nDofs in solid cell
    }

    interfaces
    (
        {
            regionA fluid;
            patchA  cylinder;
            regionB solid;
            patchB  interface;
        }
    );
}

// ************************************************************************* //
